Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum
View configuration type for IFC export

Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum.UNDEFINED


Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum.REFERENCE_VIEW


Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum.DESIGN_TRANSFER_VIEW


Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum.PRECAST_VIEW
